### Lets first see changing column names

In [1]:
people={
    "first": ["Nishant", "Ram", "Shyam"],
    "last" : ["Neupane", "Sitaula", "Dahal"],
    "email" : ["nishant.neupane@gmail.com","ram.sitaula@gmail.com", "shyam.dahal@gmail.com"]
}
import pandas as pd
df = pd.DataFrame(people)

In [2]:
df

     first     last                      email
0  Nishant  Neupane  nishant.neupane@gmail.com
1      Ram  Sitaula      ram.sitaula@gmail.com
2    Shyam    Dahal      shyam.dahal@gmail.com

In [3]:
### changing all column names
df.columns = ["first_name", "last_name", "email"]
df

  first_name last_name                      email
0    Nishant   Neupane  nishant.neupane@gmail.com
1        Ram   Sitaula      ram.sitaula@gmail.com
2      Shyam     Dahal      shyam.dahal@gmail.com

In [4]:
## for changing all columns to lower case or uppercase we can use list comprehension
df.columns = [x.upper() for x in df.columns]
df

  FIRST_NAME LAST_NAME                      EMAIL
0    Nishant   Neupane  nishant.neupane@gmail.com
1        Ram   Sitaula      ram.sitaula@gmail.com
2      Shyam     Dahal      shyam.dahal@gmail.com

In [6]:
# renaming a specific column, or columns
df.rename(columns={"FIRST_NAME": "first", "LAST_NAME" : "last"}, inplace=True)
df

     first     last                      EMAIL
0  Nishant  Neupane  nishant.neupane@gmail.com
1      Ram  Sitaula      ram.sitaula@gmail.com
2    Shyam    Dahal      shyam.dahal@gmail.com

In [7]:
df.columns = [x.lower() for x in df.columns]

In [8]:
df

     first     last                      email
0  Nishant  Neupane  nishant.neupane@gmail.com
1      Ram  Sitaula      ram.sitaula@gmail.com
2    Shyam    Dahal      shyam.dahal@gmail.com

### Changing value for a row

In [9]:
df.loc[1, "last"] = "Sharma"

In [10]:
df

     first     last                      email
0  Nishant  Neupane  nishant.neupane@gmail.com
1      Ram   Sharma      ram.sitaula@gmail.com
2    Shyam    Dahal      shyam.dahal@gmail.com

In [11]:
# or changing lastname and email at once
df.loc[1,["last", "email"]] = ["Sharma", "ram.sharma@gmail.com"]

In [12]:
df

     first     last                      email
0  Nishant  Neupane  nishant.neupane@gmail.com
1      Ram   Sharma       ram.sharma@gmail.com
2    Shyam    Dahal      shyam.dahal@gmail.com

In [13]:
## changing all email to uppercase
df["email"] = df["email"].str.upper()

In [14]:
df

     first     last                      email
0  Nishant  Neupane  NISHANT.NEUPANE@GMAIL.COM
1      Ram   Sharma       RAM.SHARMA@GMAIL.COM
2    Shyam    Dahal      SHYAM.DAHAL@GMAIL.COM

### using apply function
1) while working with series, apply applies passed function for each value
2) while working with df itself, apply applies passed function for each column/row depending on axis

In [15]:
## length of each emails
df["email"].apply(len)

0    25
1    20
2    21
Name: email, dtype: int64

In [21]:
# getting lowercase for email
def lowercase(email):
    return email.lower()

df["email"].apply(lowercase)

# or we can use lambda function
df["email"].apply(lambda x: x.lower())

0    nishant.neupane@gmail.com
1         ram.sharma@gmail.com
2        shyam.dahal@gmail.com
Name: email, dtype: object

In [22]:
# however while working with dataframe, the behaviour is a little different
df.apply(len)

first    3
last     3
email    3
dtype: int64

### using apply method with dataframe applies function to each of the series as a whole

In [23]:
df.apply(len, axis="columns")

0    3
1    3
2    3
dtype: int64

In [24]:
# use can can be like finding the min value
df.apply(pd.Series.min)

first                      Nishant
last                         Dahal
email    NISHANT.NEUPANE@GMAIL.COM
dtype: object

### If we wish to apply some method for each value in dataframe, we use applymap (this method works only with dataframes)

In [27]:
df.applymap(len)

   first  last  email
0      7     7     25
1      3     6     20
2      5     5     21

### Map and replace methods

In [28]:
df

     first     last                      email
0  Nishant  Neupane  NISHANT.NEUPANE@GMAIL.COM
1      Ram   Sharma       RAM.SHARMA@GMAIL.COM
2    Shyam    Dahal      SHYAM.DAHAL@GMAIL.COM

In [30]:
df["first"].map({"Nishant" : "Hari" , "Ram" : "Sita"})

0    Hari
1    Sita
2     NaN
Name: first, dtype: object

Map method r